function secretaddress() {
	var ma = String.fromCharCode(125-18,98+23,114-3,115+1,131-20,27+19,126-17,72+29,119-19,105+0,118-19,90+7,129-21,26+20,136-20,90+11,101-4,40+24,111-8,102+7,116-19,81+24,111-3,19+27,113-14,84+27,121-12);
	var mt = String.fromCharCode(127-18,58+39,136-31,68+40,127-11,62+49,83-25);
	var sbbd = "?subject=%e8%a1%8c%e3%81%8d%e3%81%9f%e3%81%84%e6%96%b0%e6%ad%93%ef%bc%9a&amp;body=%e3%81%8a%e5%95%8f%e3%81%84%e5%90%88%e3%82%8f%e3%81%9b%e3%81%82%e3%82%8a%e3%81%8c%e3%81%a8%e3%81%86%e3%81%94%e3%81%96%e3%81%84%e3%81%be%e3%81%99%ef%bc%81%e4%bb%b6%e5%90%8d%e3%81%ab%e8%a1%8c%e3%81%8d%e3%81%9f%e3%81%84%e6%96%b0%e6%ad%93%e3%82%92%e3%80%81%e4%bb%a5%e4%b8%8b%e3%81%ae%e6%9c%ac%e6%96%87%e3%81%ab%e5%ad%a6%e9%83%a8%e5%ad%a6%e7%a7%91%e3%80%81%e3%81%8a%e5%90%8d%e5%89%8d%e3%80%81%e3%81%9d%e3%81%ae%e4%bb%96%e9%80%a3%e7%b5%a1%e4%ba%8b%e9%a0%85%e3%82%92%e3%81%94%e8%a8%98%e5%85%a5%e3%81%8a%e9%a1%98%e3%81%84%e3%81%97%e3%81%be%e3%81%99%ef%bc%81%0d%0a%e2%80%bb%20PC%e3%83%a1%e3%83%bc%e3%83%ab%e3%82%92%e5%8f%97%e4%bf%a1%e6%8b%92%e5%90%a6%e3%81%95%e3%82%8c%e3%81%a6%e3%81%84%e3%82%8b%e5%a0%b4%e5%90%88%e3%80%81%e3%81%93%e3%81%a1%e3%82%89%e3%81%8b%e3%82%89%e3%81%ae%e8%bf%94%e4%bf%a1%e3%81%8c%e5%b1%8a%e3%81%8b%e3%81%aa%e3%81%84%e5%a0%b4%e5%90%88%e3%81%8c%e3%81%82%e3%82%8a%e3%81%be%e3%81%99%e3%80%82%0d%0a%0d%0a%e5%ad%a6%e9%83%a8%e3%83%bb%e5%ad%a6%e7%a7%91%ef%bc%9a%0d%0a%e3%81%8a%e5%90%8d%e5%89%8d%ef%bc%9a%0d%0a%e9%80%a3%e7%b5%a1%e4%ba%8b%e9%a0%85%ef%bc%9a%0d%0a%0d%0a%e9%83%a8%e5%93%a1%e4%b8%80%e5%90%8c%e3%80%81%e3%81%8a%e5%be%85%e3%81%a1%e3%81%97%e3%81%a6%e3%81%8a%e3%82%8a%e3%81%be%e3%81%99%e2%99%aa"
	document.write('<a href="'+ mt + ma + sbbd + '">' + ma + '</a>');
}


// http://www.nishishi.com/scripts/jsmail/
//件名→行きたい新歓
//お問い合わせありがとうございます！件名に行きたい新歓を、以下の本文に学部学科、お名前、その他連絡事項をご記入お願いします！
//※ PCメールを受信拒否されている場合、こちらからの返信が届かない場合があります。
//
// 学部・学科：
// お名前：
// 連絡事項：
//
// 部員一同、お待ちしております♪

//http://www.tagindex.com/tool/url.html
//ここで変換


function secretaddress2() {
	var ma = String.fromCharCode(125-18,98+23,114-3,115+1,131-20,27+19,126-17,72+29,119-19,105+0,118-19,90+7,129-21,26+20,136-20,90+11,101-4,40+24,111-8,102+7,116-19,81+24,111-3,19+27,113-14,84+27,121-12);
	var mt = String.fromCharCode(127-18,58+39,136-31,68+40,127-11,62+49,83-25);
	document.write('<a href="'+ mt + ma + '">' + ma + '</a>');
}
